<%@ page language="java" contentType="text/html; charset=UTF-8"  pageEncoding="UTF-8"%>
<!doctype html>
<html lang="ko">
<head>
	<%@ include file="/WEB-INF/views/front/inc/header.jsp" %>
</head>
<body>
		<%@ include file="/WEB-INF/views/front/inc/gnb.jsp" %>
	<main>
		<div class="sub subEyecareJoinRetinaRevision page-join">
			<div class="join_wrap"><!-- 회원가입 -->
				<h2 class="cont-tit">회원가입</h2>
				<ul class="join-process">
					<li class="active">
						<span class="ls0">01</span> 약관 동의
					</li>
					<li class="process-symbol"><span class="f_go">&lt;</span></li>
					<li>
						<span class="ls0">02</span> 정보 입력
					</li>
					<li class="process-symbol"><span class="f_go">&lt;</span></li>
					<li>
						<span class="ls0">03</span> 가입 완료
					</li>
				</ul>
				<div class="wsize">
					<div class="inner">
						<h4 class="terms-head">약관동의</h4>
						<p class="terms-desc">
							아래의 약관 및 개인정보 취급방침을 읽어보시고 동의해주시기 바랍니다. <br>
							11.9.30 개인정보보호법 시행에 따라, 해당 법령 준수를 위하여, 정보수집 및 이용에 <br>
							대한 동의 절차를 강화하였습니다. 불편하시더라도 양해 부탁 드립니다.
						</p>
						<ul class="terms-list">
							<li>
								<div class="check-row">
									<div class="check_box">
										<input type="checkbox" id="checkAll" name="checkAll">
										<label for="checkAll">전체 동의</label>
									</div>
								</div>
							</li>
							<li>
								<div class="check-row">
									<div class="check_box">
										<input type="checkbox" id="check1" name="check1">
										<label for="check1">서비스 이용약관 동의 <span>(필수)</span> </label>
									</div>
									<a href="javascript:void(0)" class="slide-btn check1-slide">
										<span>내용보기</span><img src="/common/img/sub/arrow_down_b.png" alt="arrow">
									</a>
								</div>
								<div class="terms-wrap">
									<p class="terms-cont">
제 1 장 총 칙
제1조 (목적)
이 약관은 강남그랜드안과의원(이하 "본원"라 합니다)이 홈페이지에서 제공하는 모든 서비스의 이용조건 및 절차에 관한 사항과 기타 필요한 사항을 정함을 목적으로 합니다.
제2조 (정의)
이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
1. "이용자"라 함은 홈페이지에 접속하여 이 약관에 따라 홈페이지가 제공하는 서비스를 받는 회원 및 비회원을 말합니다.
2. "회원"이라 함은 홈페이지에 개인정보를 제공하여 회원등록을 한 자로서, 홈페이지의 정보를 지속적으로 제공받으며, 홈페이지가 제공하는 서비스를 계속적으로 이용할 수 있는 자를 말합니다.
3. "비회원"이라 함은 회원에 가입하지 않고 본원 홈페이지에서 제공하는 서비스를 이용하는 자를 말합니다.
제3조 (약관의 효력과 변경)
이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
① 이 약관은 본원 홈페이지에 게시하여 공시함으로써 효력이 발생합니다.
② 본원은 합리적인 사유가 발생될 경우에는 이 약관을 변경할 수 있으며, 약관이 변경된 경우에는 지체없이 이를 공시합니다.
③ 제2항에 의거, 변경된 약관은 제1항과 같은 방법으로 효력이 발생합니다.
④ 회원은 변경된 약관 사항에 동의하지 않으면 서비스 이용을 중단하고 이용계약을 해지할수 있습니다.
⑤ 약관의 효력 발생일 이후의 계속적인 서비스 이용은 약관의 변경사항에 동의한 것으로 간주됩니다.
제4조 (약관외 준칙)
이 약관에 명시되지 않은 사항이 관계 법령에 규정되어 있을 경우에는 그 규정에 따릅니다.
제 2 장 회원 가입 및 서비스 이용
제5조 (서비스 이용 계약의 성립)
① 본원 홈페이지상 서비스 이용 계약은 이용자가 회원 가입에 따른 서비스 이용 신청에 대한 본원의 이용 승낙과 이용자의 이 약관에 동의한다는 의사표시로 성립됩니다.
② 이용자가 회원에 가입하여 본원 홈페이지상 서비스를 이용하고자 하는 경우, 회원은 본원에서 요청하는 개인 신상정보를 제공해야 합니다.
③ 이용자의 본원 홈페이지상 서비스 이용신청에 대하여 본원가 승낙한 경우, 본원은 회원 ID와 기타 본원가 필요하다고 인정하는 내용을 회원에게 통지합니다.
④ 본원은 다음 각 호에 해당하는 서비스 이용 신청에 대하여는 이를 승낙하지 아니합니다.
1. 다른 사람의 명의를 사용하여 신청하였을 때
2. 본인의 실명으로 신청하지 않았을 때
3. 서비스 이용 계약 신청서의 내용을 허위로 기재하였을 때
4. 사회의 안녕과 질서 혹은 미풍양속을 저해할 목적으로 신청하였을 때
제6조 (서비스 이용 및 제한)
① 본원 홈페이지상 서비스 이용은 본원의 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴, 1일 24시간을 원칙으로 합니다.
② 전항의 서비스 이용시간은 시스템 등 정기점검/교체 등 본원가 필요한 경우, 회원에게 사전 통지한 후, 제한할 수 있습니다.
③ 제2항에 의한 서비스 중단의 경우에는 본원은 회원이 본원의 홈페이지에 제출한 전자우편 주소로 개별 통지하거나, 불특정다수 회원에 대하여는 홈페이지 초기화면에 서비스 중단 3일전 게시함으로써 개별 통지에 갈음할 수 있습니다.
제7조 (연결 홈페이지와 피연결 홈페이지간의 관계)
① 상위 홈페이지와 하위 홈페이지가 하이퍼 링크방식 등으로 연결된 경우, 전자를 연결 홈페이지라고 하고 후자를 피연결 홈페이지라고 합니다.
② 연결 홈페이지는 피연결 홈페이지가 독자적으로 제공하는 재화·용역에 의하여 이용자와 행하는 거래에 대해서 보증책임을 지지 않습니다.
제8조 (저작권의 귀속 및 이용제한)
① 본원가 작성한 저작물에 대한 저작권 기타 지적재산권은 본원에 귀속됩니다.
② 이용자는 본원의 홈페이지를 이용함으로써 얻은 정보를 본원의 사전 승낙없이 복제, 송신, 출판, 배포 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안됩니다.
제 3 장 의 무
제9조 (본원의 의무)
① 본원은 특별한 사정이 없는 한 회원이 신청한 서비스 제공 개시일에 서비스를 이용할 수 있도록 합니다.
② 본원은 이 약관에서 정한 바에 따라 계속적, 안정적으로 서비스를 제공할 의무가 있습니다.
③ 본원은 회원으로부터 소정의 절차에 의해 제기되는 의견에 대해서는 적절한 절차를 거쳐 처리하며, 처리시 일정 기간이 소요될 경우 회원에게 그 사유와 처리 일정을 알려주어야 합니다.
④ 본원은 회원의 정보를 철저히 보안 유지하며, 양질의 서비스를 운영하거나 개선하는 경우 또는 제품소개 등 본원 내부 목적으로 이용하는 데만 사용하고, 이외의 다른 목적으로 타 기관 및 제3자에게 양도하지 않습니다.
제10조 (회원의 의무)
① ID와 비밀번호에 관한 모든 관리의 책임은 회원에게 있습니다.
② 회원은 ID 및 비밀번호를 제3자에게 이용하게 해서는 안됩니다.
③ 회원은 ID 및 비밀번호를 도난당하거나 제3자가 사용하고 있음을 인지하는 경우에는 회원은 즉시 본원에 그 사실을 통보해야 합니다.
⑤ 이용자는 다음 행위를 하여서는 안됩니다.
1. 신청 또는 변경시 허위내용의 등록
2. 본원 홈페이지에 게시된 정보의 변경
3. 본원 홈페이지가 정한 정보 이외의 정보(컴퓨터 프로그램 등)의 송신 또는 게시
4. 본원 홈페이지 기타 제3자의 저작권 등 지적재산권에 대한 침해
5. 본원 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
6. 외설 또는 폭력적인 메시지, 화상, 음성 기타 공서양속에 반하는 정보를 공개 또는 게시하는 행위
제 4 장 서비스 이용 계약 해지 및 이용 제한
제11조 (서비스 이용 계약 해지 및 이용 제한)
① 회원이 서비스 이용 계약을 해지하고자 하는 때에는 회원 본인이 직접 회원가입 메뉴의 회원탈퇴 서비스를 이용하여 서비스 이용 계약 해지 신청을 요청해야 합니다.
② 전항의 경우, 회원은 이름, 주민등록번호, ID를 입력하여 본인임을 확인한 후 , 해지요청을 하시면 회원 가입 및 서비스 이용 계약이 해지됩니다.
③ 본원은 이용자가 본 계약 제10조 제5항에 위반한 경우 상당한 기간을 정하여 서비스 이용을 중지할 수 있습니다.
④ 본원은 회원이 다음 사항에 해당하는 행위를 하였을 경우 사전 통지 없이 서비스 이용 계약을 해지할 수 있다.
1. 공공 질서 및 미풍 양속에 반하는 경우
2. 범죄적 행위에 관련되는 경우
3. 국익 또는 사회적 공익을 저해할 목적으로 서비스 이용을 계획 또는 실행할 경우
4. 타인의 ID 및 비밀번호를 도용한 경우
5. 타인의 명예를 손상시키거나 불이익을 주는 경우
6. 같은 사용자가 다른 ID로 이중 등록을 한 경우
7. 서비스에 위해를 가하는 등 건전한 이용을 저해하는 경우
8. 기타 관련 법령이나 본원가 정한 이용조건에 위배되는 경우
제12조 (서비스 이용 제한의 해제 절차)
① 본원은 서비스 이용 제한을 하고자 하는 경우에는 그 사유, 일시 및 기간을 정하여 서면 또는 전화 등의 방법을 이용하여 해당 회원 또는 대리인에게 통지합니다.
② 다만, 본원가 긴급하게 이용을 제한해야 할 필요가 있다고 인정하는 경우에는 전항의 과정없이 서비스 이용을 제한할 수 있습니다.
③ 전항의 규정에 의하여 서비스 이용 중지를 통지 받은 회원 또는 그 대리인은 서비스 이용 중지에 대하여 이의신청을 할 수 있습니다.
④ 본원은 서비스 이용중지 기간 중에 그 이용중지 사유가 해소된 것이 확인된 경우에 한하여 이용중지 조치를 즉시 해제합니다.
제13조 (회원의 게시물 관리)
본원은 회원이 게시하거나 등록한 내용물이 다음 사항에 해당된다고 판단되는 경우에 사전 통지 없이 삭제할 수 있습니다.

1. 타인 또는 본원를 비방하거나 중상모략으로 개인, 단체 및 본원의 명예를 손상시키는 내용인 경우
2. 외설 또는 폭력적인 메시지·화상·음성, 기타 공공질서 및 미풍양속에 위반되는 내용인 경우
3. 범죄적 행위에 부합된다고 인정되는 내용인 경우
4. 타인의 저작권 등 기타의 권리를 침해하는 내용인 경우
5. 기타 관계 법령이나 본원에서 정한 규정에 위배되는 내용인 경우
제 5 장 개인정보보호 정책
제14조 (이용자의 개인정보보호 정책)
본원은 관련법령이 정하는 바에 따라서 이용자 등록정보를 포함한 이용자의 개인정보를 보호하기 위하여 노력한다. 이용자의 개인정보보호에 관해서는 관련법령 및 본원가 정하는 "개인정보보호정책"에 정한 바에 의한다.

부 칙 (시행일)

이 약관은 2021년 2월 1일부터 시행합니다.
									</p>
								</div>
							</li>
							<li>
								<div class="check-row">
									<div class="check_box">
										<input type="checkbox" id="check2" name="check2">
										<label for="check2">개인정보취급방침 동의 <span>(필수)</span> </label>
									</div>
									<a href="javascript:void(0)" class="slide-btn check2-slide">
										<span>내용보기</span><img src="/common/img/sub/arrow_down_b.png" alt="arrow">
									</a>
								</div>
								<div class="terms-wrap">
									<p class="terms-cont">
'강남그랜드안과의원'은 (이하 '본원'은) 고객님의 개인정보를 중요시하며, "정보통신망 이용촉진 및 정보보호"에 관한 법률을 준수하고 있습니다.
본원은 개인정보취급방침을 통하여 고객님께서 제공하시는 개인정보가 어떠한 용도와 방식으로 이용되고 있으며, 개인정보보호를 위해 어떠한 조치가 취해지고 있는지 알려드립니다.
본원은 개인정보취급방침을 개정하는 경우 웹사이트 공지사항(또는 개별공지)을 통하여 공지할 것입니다.

1. 수집하는 개인정보의 항목 및 수집방법
본원은 회원가입 시 서비스 이용을 위해 필요한 최소한의 개인정보만을 수집합니다.
귀하가 본원의 서비스를 이용하기 위해서는 회원가입 시 필수항목과 선택항목이 있는데,
메일수신여부 등과 같은 선택항목은 입력하지 않더라도 서비스 이용에는 제한이 없습니다.

[진료정보]
- 수집항목 : 성명, 주민등록번호, 주소, 연락처, 진료기록
※ 의료법에 의해 고유식별정보 및 진료정보를 의무적으로 보유하여야 함
(별도 동의 불필요)

[홈페이지 회원가입 시 수집항목]
- 필수항목 : 성명, 아이디, 비밀번호, 주소, 연락처(전화번호, 휴대폰번호)
- 선택항목 : 이메일, 메일수신여부
- 서비스 이용 과정이나 서비스 제공 업무 처리 과정에서 다음과 같은 정보들이 자동으로 생성되어 수집될 수 있습니다. : 서비스 이용기록, 접속 로그, 쿠키, 접속 IP 정보
[개인정보 수집방법]
- 다음과 같은 방법으로 개인정보를 수집합니다.
홈페이지, 서면양식, 팩스, 전화, 상담 게시판, 이메일
2. 개인정보의 수집 및 이용목적
본원은 수집한 개인정보를 다음의 목적을 위해 활용합니다.
이용자가 제공한 모든 정보는 하기 목적에 필요한 용도 이외로는 사용되지 않으며 이용
목적이 변경될 시에는 사전 동의를 구할 것입니다.

[진료정보]
- 진단 및 치료를 위한 진료서비스와 청구, 수납 및 환급 등의 원무서비스 제공
[홈페이지 회원정보]
- 필수정보 : 홈페이지를 통한 진료 예약, 예약조회 및 회원제 서비스 제공,
- 선택정보 : 이메일을 통한 병원소식, 질병정보 등의 안내, 설문조사
[마케팅 및 광고에 활용]
- 이벤트 등 광고성 정보 전달, 접속 빈도 파악 또는 회원의 서비스 이용에 대한 통계
3. 개인정보의 보유 및 이용기간
본원은 개인정보의 수집목적 또는 제공받은 목적이 달성된 때에는 귀하의 개인정보를 지체 없이 파기합니다.

[진료정보]
- 의료법에 명시된 진료기록 보관 기준에 준하여 보관
[홈페이지 회원정보]
- 회원가입을 탈퇴하거나 회원에서 제명된 때
다만, 수집목적 또는 제공받은 목적이 달성된 경우에도 상법 등 법령의 규정에 의하여
보존할 필요성이 있는 경우에는 귀하의 개인정보를 보유할 수 있습니다.
- 선택정보 : 이메일을 통한 병원소식, 질병정보 등의 안내, 설문조사
- 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년 (전자상거래 등에서의 소비자보호에 관한 법률)
- 신용정보의 수집/처리 및 이용 등에 관한 기록 : 3년 (신용정보의 이용 및 보호에 관한 법률)
- 본인 확인에 관한 기록 : 6개월 (정보통신망 이용촉진 및 정보보호 등에 관한 법률)
- 방문에 관한 기록 : 3개월 (통신비밀보호법)
									</p>
								</div>
							</li>
							<li>
								<div class="check-row">
									<div class="check_box">
										<input type="checkbox" id="check3" name="check3">
										<label for="check3">고유식별 번호 동의 <span>(필수)</span> </label>
									</div>
									<a href="javascript:void(0)" class="slide-btn check3-slide">
										<span>내용보기</span><img src="/common/img/sub/arrow_down_b.png" alt="arrow">
									</a>
								</div>
								<div class="terms-wrap">
									<p class="terms-cont">
고객님의 고유식별정보를 처리(수집, 이용, 제공, 조회등)하기 위해서는 「개인정보보호법」제24조에 의하여 동의를 얻어야 합니다. 여기서 제공해주시는 고유식별정보는 요청하신 서비스를 제공하는 목적에 부합하는 용도로만 사용됩니다.

1. 수집 및 이용목적
- 회원가입, 온라인예약, 온라인상담, 예약기록 확인, 검사내역조회 서비스 이용시 본인의 확인
- 고지사항 전달, 본인 의사확인, 불만처리 등 원활한 의사소통 경로의 확보
- 회원 관심분야에 따른 각종 개인 맞춤 서비스의 제공

2. 수집하는 개인정보 항목
- 이름, 생년월일, 휴대폰번호, 집주소, 기타 부가서비스 내용

3. 보유 및 이용기간
회원 탈회 요청이 있는 등 서비스 목적 달성시 즉시 폐기합니다.
다만, 다음의 정보에 대해서는 아래의 이유로 예외로 합니다.
- 고객님이 '강남그랜드안과의원'에 대하여 '별도의 개인정보에 관한 동의'를 한 경우(금융거래 등 상거래의 체결 유지 관리 목적 등)로서 해당 동의 목적으로 위 개인정보가 수집 및 이용되는 경우에는 해당 동의에 따른 보유 및 이용기간이 적용됩니다.
									</p>
								</div>
							</li>
						</ul>
						<button class="btn_apply btn-tAgree" type="button">다음</button>
					</div>
				</div>
			</div>
		</div>
	</main>
	<%@ include file="/WEB-INF/views/front/inc/footer.jsp" %>
	<script type="text/javascript">
		//내용보기
		$('.slide-btn').on('click', function(){
			$(this).parents('li').find('.terms-wrap').slideToggle();
			$(this).toggleClass('active');
		})
		
		//전체동의
		$('input[name=checkAll]').on('click', function(){
			if($(this).prop('checked')){
				$('input[name^=check]').prop('checked', true);
			}else{
				$('input[name^=check]').prop('checked', false);
			}
		});

		//약관동의체크
		$('.btn-tAgree').on('click', function(){
			if(!$("input[name='check1']").is(":checked")){
				alert("서비스 이용약관 내용에 동의하셔야 회원가입 하실 수 있습니다.");
				$('input[name=check1]').focus();
				return false;
			}
			if(!$("input[name='check2']").is(":checked")){
				alert("개인정보취급방침 내용에 동의하셔야 회원가입 하실 수 있습니다.");
				$('input[name=check2]').focus();
				return false;
			}
			if(!$("input[name='check3']").is(":checked")){
				alert("고유식별 번호 동의 내용에 동의하셔야 회원가입 하실 수 있습니다.");
				$('input[name=check3]').focus();
				return false;
			}
			
			location.href = "/user/join_info";
			
		});
	</script>
</body>
</html>